               05  AID        PIC 9(5).
               05  AName      PIC X(20).
               05  ALoginName PIC X(25).
               05  AEncPsw    PIC X(32).
               05  role       PIC 9.
