       *> Color codes copybook
       77  REDX                 PIC X(6) VALUE "[1;31m".  *> set red
       77  ESC                  PIC X    VALUE X"1B".    *> ASCII ESC
       77  RESETX               PIC X(4) VALUE "[0m".    *> reset
       77  GREENX               PIC X(6) VALUE "[1;32m". *> set green
       77  COLOR-BLUE           PIC X(5) VALUE X"1B5B33346D".
       77  color-pink           pic x(5) value X"1B5B33356D". *> Esc[35m"
       77  Color-yellow         PIC X(5) VALUE X"1B5B33336D".
