      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Maintenance.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT section.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       linkage SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM Maintenance.
