           05  TrxID       PIC X(11).
           05  SenderAcc    PIC 9(16).
           05  ReceiverAcc  PIC 9(16).
           05  Description PIC X(30).
           05  Amount      PIC 9(10)v99.
           05  TrxType     PIC 9.
           05  TimeStamp   PIC 9(14).
