       *>min values and max values for deposit

       01  minAmoDepo      PIC 9(10) VALUE 10000.
       01  maxAmoDepo      PIC 9(10) VALUE 2000000.
